app/Http/Controllers/Auth/RegisteredUserController.php

    public function showRegistrationForm($ref = '', $plan_id = '', $lang = '')
    {
        $setting = Utility::getAdminPaymentSetting();
        if ($lang == '') {
            $lang = $setting['default_admin_lang'] ? $setting['default_admin_lang'] : 'en';
        }
        $langList = Utility::langList();
        $lang = array_key_exists($lang, $langList) ? $lang : 'en';
        if (empty($lang)) {
            $lang = Utility::getValByName('default_language');
        }
        \App::setLocale($lang);

        if ($ref == '') {
            $ref = 0;
        }
        $refCode = User::where('referral_code', '=', $ref)->first();
---
select * from `users` where `referral_code` = 0 limit 1