app/Http/Controllers/CalenderController.php

    public function calendar(Request $request, $slug, $project_id = NULL)
    {
        if (Auth::user()->type != 'admin') {
            $currentWorkspace = Utility::getWorkspaceBySlug($slug);

            if (($request->get('calender_type') == 'google_calendar') && ($request->get('project_id') == null)) {

                $arrayJson = [];
                $type = 'task';
                $arrayJson = Utility::getCalendarData($slug, $type);
                return $arrayJson;
                // ($currentWorkspace->is_googlecalendar_enabled == 0 ) ||
            } else {

                $objUser = Auth::user();
                //$currentWorkspace = Utility::getWorkspaceBySlug($slug);

                if ($objUser->getGuard() == 'client') {
                    $tasks = Task::select('tasks.*')->join('projects', 'projects.id', '=', 'tasks.project_id')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('client_projects.permission', 'LIKE', '%show task%')->where('projects.workspace', '=', $currentWorkspace->id);
                    $projects = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
                } elseif ($currentWorkspace && $currentWorkspace->permission == 'Owner') {
                    $tasks = Task::select('tasks.*')->join('projects', 'projects.id', '=', 'tasks.project_id')->where('projects.workspace', '=', $currentWorkspace->id);
                    $projects = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 2 and `projects`.`workspace` = 1

                } elseif ($currentWorkspace->permission == 'Owner') {
                    $events = Task::select('tasks.*')->join('projects', 'projects.id', '=', 'tasks.project_id')->where('projects.workspace', '=', $currentWorkspace->id)->limit(8);
                } else {
                    $events = Task::select('tasks.*')->join('projects', 'projects.id', '=', 'tasks.project_id')->where('projects.workspace', '=', $currentWorkspace->id)->whereRaw("find_in_set('" . Auth::user()->id . "',tasks.assign_to)")->limit(8);
---
select `tasks`.* from `tasks` inner join `projects` on `projects`.`id` = `tasks`.`project_id` where `projects`.`workspace` = 1