app/Http/Controllers/ContractController.php




            $contracts = Contract::where('workspace_id', '=', $currentWorkspace->id)->with('clients', 'projects', 'contract_type')->get();
            $curr_month = Contract::where('workspace_id', '=', $currentWorkspace->id)->whereMonth('start_date', '=', date('m'))->get();
            $curr_week = Contract::where('workspace_id', '=', $currentWorkspace->id)->whereBetween(
                'start_date',
                [
                    \Carbon\Carbon::now()->startOfWeek(),
                    \Carbon\Carbon::now()->endOfWeek(),
                ]
            )->get();
---
select * from `contracts` where `workspace_id` = 1
select * from `contracts` where `workspace_id` = 1 and month(`start_date`) = '03'
select * from `contracts` where `workspace_id` = 1 and `start_date` between '2025-03-10 00:00:00' and '2025-03-16 23:59:59'