app/Http/Controllers/CouponController.php

select * from `coupons`
---
    public function index()
    {
        if (\Auth::user()->type == 'admin') {
            $coupons = Coupon::get();