app/Http/Controllers/HomeController.php

    public function landingPage()
    {
        if (!file_exists(storage_path() . "/installed")) {

            header('location:install');
            die;
        }
        $setting = Utility::getAdminPaymentSetting();

        // $currentWorkspace = Utility::getWorkspaceBySlug('');
        $paymentSetting = Utility::getAdminPaymentSetting();



        if ($setting['display_landing'] == 'on' && \Schema::hasTable('landing_page_settings')) {

            $plans = Plan::get();
---
select * from `plans`

    public function index($slug = '')
    {

        $userObj = Auth::user();

        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($userObj->type == 'admin') {
            $totalUsers = User::where('type', '!=', 'admin')->count();
            $totalPaidUsers = User::where('type', '!=', 'admin')->where('plan', '!=', 1)->count();
            $totalOrderAmount = Order::where('payment_status', '=', 'succeeded')->sum('price');
            $totalOrders = Order::where('payment_status', '=', 'succeeded')->count();
            $totalPlans = Plan::count();
            $mostPlans = Plan::where('id', function ($query) {
                $query->select('plan_id')->from('orders')->groupBy('plan_id')->orderBy(\DB::raw('COUNT(plan_id)'))->limit(1);
            })->first();

            $chartData = $this->getOrderChart(['duration' => 'week']);


            return view('home', compact('totalUsers', 'totalPaidUsers', 'totalOrders', 'totalOrderAmount', 'totalPlans', 'mostPlans', 'chartData'));
        } elseif ($currentWorkspace) {
            $doneStage = Stage::where('workspace_id', '=', $currentWorkspace->id)->where('complete', '=', '1')->first();
---
select * from `stages` where `workspace_id` = 1 and `complete` = '1' limit 1

                return view('home', compact('currentWorkspace', 'totalProject', 'totalBugs', 'totalTask', 'totalMembers', 'arrProcessLabel', 'arrProcessPer', 'arrProcessClass', 'completeTask', 'tasks', 'chartData', 'tasksUsers'));

            } else {
                $totalProject = UserProject::join("projects", "projects.id", "=", "user_projects.project_id")->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->count();

                $workspace_owner = isset($currentWorkspace) ? $currentWorkspace->owner($currentWorkspace->id) : '';
                $users = User::find($workspace_owner->id);
                $plan = Plan::find($users->plan);
                $storage_limit = $plan->storage_limit > 0 ? (($users->storage_limit / $plan->storage_limit) * 100) : 0;
                $storage_limit = number_format($storage_limit, 2);
                if ($currentWorkspace->permission == 'Owner') {
                    $totalBugs = UserProject::join("bug_reports", "bug_reports.project_id", "=", "user_projects.project_id")->join("projects", "projects.id", "=", "user_projects.project_id")->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->count();
                    $totalTask = UserProject::join("tasks", "tasks.project_id", "=", "user_projects.project_id")->join("projects", "projects.id", "=", "user_projects.project_id")->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->count();
                    $completeTask = UserProject::join("tasks", "tasks.project_id", "=", "user_projects.project_id")->join("projects", "projects.id", "=", "user_projects.project_id")->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('tasks.status', '=', $doneStage->id)->count();
                    $tasks = Task::select([
                        'tasks.*',
                        'stages.name as status',
                        'stages.complete',
                        'tasks.assign_to as users',
                    ])->join("user_projects", "tasks.project_id", "=", "user_projects.project_id")->join("projects", "projects.id", "=", "user_projects.project_id")->join("stages", "stages.id", "=", "tasks.status")->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->orderBy('tasks.id', 'desc')->with('project')->limit(5)->get();
---
select count(*) as aggregate from `user_projects` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_id` = 2 and `projects`.`workspace` = 1
select * from `users` where `users`.`id` = 2 limit 1
select * from `plans` where `plans`.`id` = 4 limit 1
select count(*) as aggregate from `user_projects` inner join `bug_reports` on `bug_reports`.`project_id` = `user_projects`.`project_id` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_id` = 2 and `projects`.`workspace` = 1
select count(*) as aggregate from `user_projects` inner join `tasks` on `tasks`.`project_id` = `user_projects`.`project_id` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_id` = 2 and `projects`.`workspace` = 1
select count(*) as aggregate from `user_projects` inner join `tasks` on `tasks`.`project_id` = `user_projects`.`project_id` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_id` = 2 and `projects`.`workspace` = 1 and `tasks`.`status` = 4
select * from `projects` where `projects`.`id` in (1)
select `tasks`.*, `stages`.`name` as `status`, `stages`.`complete`, `tasks`.`assign_to` as `users` from `tasks` inner join `user_projects` on `tasks`.`project_id` = `user_projects`.`project_id` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` inner join `stages` on `stages`.`id` = `tasks`.`status` where `user_id` = 2 and `projects`.`workspace` = 1 order by `tasks`.`id` desc limit 5

                    ])->join("user_projects", "tasks.project_id", "=", "user_projects.project_id")->join("projects", "projects.id", "=", "user_projects.project_id")->join("stages", "stages.id", "=", "tasks.status")->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->whereRaw("find_in_set('" . $userObj->id . "',tasks.assign_to)")->orderBy('tasks.id', 'desc')->with('project')->limit(5)->get();
                }

                $totalMembers = UserWorkspace::where('workspace_id', '=', $currentWorkspace->id)->count();

                $projectProcess = UserProject::join("projects", "projects.id", "=", "user_projects.project_id")->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->groupBy('projects.status')->selectRaw('count(projects.id) as count, projects.status')->pluck('count', 'projects.status');
---
select count(*) as aggregate from `user_workspaces` where `workspace_id` = 1
select count(projects.id) as count, projects.status from `user_projects` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_id` = 2 and `projects`.`workspace` = 1 group by `projects`.`status`

                    'duration' => 'week',
                ]);

                $tasksUsers = Task::orderBy('tasks.id', 'desc')
                    ->join("user_projects", "tasks.project_id", "=", "user_projects.project_id")
                    ->join("projects", "projects.id", "=", "user_projects.project_id")
                    ->join("stages", "stages.id", "=", "tasks.status")
                    ->join("users", function ($join) {
                        $join->on("users.id", "=", \DB::raw("CAST(SUBSTRING_INDEX(tasks.assign_to, ',', 1) AS SIGNED)"))
                            ->orWhere("users.id", "=", \DB::raw("CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(tasks.assign_to, ',', -2), ',', 1) AS SIGNED)"))
                            ->orWhere("users.id", "=", \DB::raw("CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(tasks.assign_to, ',', -1), ',', 1) AS SIGNED)"));
                    })
                    ->where("user_id", "=", $userObj->id)
                    ->where('projects.workspace', '=', $currentWorkspace->id)
                    ->limit(5)
                    ->select(['users.name', 'users.id'])
                    ->distinct()
                    ->get()
                    ->pluck('name', 'id')
                    ->toArray();
---
select distinct `users`.`name`, `users`.`id` from `tasks` inner join `user_projects` on `tasks`.`project_id` = `user_projects`.`project_id` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` inner join `stages` on `stages`.`id` = `tasks`.`status` inner join `users` on `users`.`id` = CAST(SUBSTRING_INDEX(tasks.assign_to, ',', 1) AS SIGNED) or `users`.`id` = CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(tasks.assign_to, ',', -2), ',', 1) AS SIGNED) or `users`.`id` = CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(tasks.assign_to, ',', -1), ',', 1) AS SIGNED) where `user_id` = 2 and `projects`.`workspace` = 1 order by `tasks`.`id` desc limit 5