app/Http/Controllers/NotificationTemplatesController.php

select * from `notification_templates` limit 1
select * from `notification_template_langs` where `parent_id` = 1 and `lang` = 'en' and `created_by` = 7 limit 1
select * from `notification_template_langs` where `parent_id` = 1 and `lang` = 'en' limit 1
select * from `notification_templates`
---
    public function index($slug = '', $id = null, $lang = 'en', $type = 'slack')
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        // if(\Auth::user()->type == 'super admin' || \Auth::user()->type == 'company')
        // {
        // $types = NotificationTemplates::$types;

        if ($id != null) {
            $notification_template = NotificationTemplates::where('id', $id)->first();
        } else {
            $notification_template = NotificationTemplates::first();
        }
        if (empty($notification_template)) {
            return redirect()->back()->with('error', __('Not exists in notification template.'));
        }

        $languages = Utility::languages();
        $curr_noti_tempLang = NotificationTemplateLangs::where('parent_id', '=', $notification_template->id)->where('lang', $lang)->where('created_by', \Auth::user()->id)->first();

        if (!isset($curr_noti_tempLang) || empty($curr_noti_tempLang)) {
            $curr_noti_tempLang = NotificationTemplateLangs::where('parent_id', '=', $notification_template->id)->where('lang', $lang)->first();
        }

        if (!isset($curr_noti_tempLang) || empty($curr_noti_tempLang)) {
            $curr_noti_tempLang = NotificationTemplateLangs::where('parent_id', '=', $notification_template->id)->where('lang', 'en')->first();
            !empty($curr_noti_tempLang) ? $curr_noti_tempLang->lang = $lang : null;
        }

        $notification_templates = NotificationTemplates::get();