app/Http/Controllers/PlanController.php

select * from `user_coupons` where `user_coupons`.`order` in ('672602503AEDE755340788', '6727649C5C26F878320588', '673377F4F025A287830482', '67337A87CB8A4803313840', '67337CE92EFAA895452660', '673382184D590502364549', '67345625DE42E979779245', '673F0E29AC3B8723518954', '673F0E54A4D63656890233', '677BD0CC78A11208717157', '677BD81BB7259939557562', '6780FEB45D00E610910662', '67D0A9B8EE47E111758001', '67D0AB24409B3636732787', '67D16C1338637092874608', '67D16C4D526D8164574132', '67D16C683C5E7979025704', '67D17D3A5EAD2009828562', '67D17FC48346B176508111')
select `orders`.*, `users`.`name` as `user_name` from `orders` inner join `users` on `orders`.`user_id` = `users`.`id` order by `orders`.`created_at` desc
select * from `orders` where `id` in (select MAX(id) from `orders` group by `user_id`) order by `created_at` desc
select * from `plans`
---
    public function index()
    {
        $currentWorkspace = Utility::getWorkspaceBySlug('');
        $paymentSetting = Utility::getAdminPaymentSetting();
        $objUser = \Auth::user();

        if ($objUser->type == 'admin' || $currentWorkspace->creater->id == $objUser->id) {
            $query = Order::select([
                'orders.*',
                'users.name as user_name',
            ])->join('users', 'orders.user_id', '=', 'users.id');

            if ($objUser->type !== 'admin') {
                $query->where('users.id', $objUser->id);
            }

            // Eager load the relationships
            $orders = $query->with('total_coupon_used.coupon_detail')->orderBy('orders.created_at', 'DESC')->get();
            $userOrders = Order::select('*')
                ->whereIn('id', function ($query) {
                    $query->selectRaw('MAX(id)')
                        ->from('orders')
                        ->groupBy('user_id');
                })
                ->orderBy('created_at', 'desc')
                ->get();

            if ($objUser->type == 'admin') {
                $plans = Plan::get();

select * from `plans` where `plans`.`id` = '4' limit 1
---
    public function edit($planID)
    {
        $plan = Plan::find($planID);

select * from `plans` where `plans`.`id` = 4 limit 1
---
            ) {
                try {
                    $planID = \Illuminate\Support\Facades\Crypt::decrypt($code);
                    $plan = Plan::find($planID);