app/Http/Controllers/ProjectController.php

    public function index($slug)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($objUser->getGuard() == 'client') {
            $projects = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $projects = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 2 and `projects`.`workspace` = 1

    public function share($slug, $projectID, Request $request)
    {

        $authuser = Auth::user();
        $authusername = User::where('id', '=', $authuser->id)->first();
        $project = Project::find($projectID);
        $setting = Utility::fetchAdminPaymentSetting();
        foreach ($request->clients as $client_id) {
            $client = Client::find($client_id);
            $user = Client::find($client_id);
            $currentWorkspace = Utility::getWorkspaceBySlug($slug);
            $workspaceId = $currentWorkspace->id;

            //for permission
            $allPermission = Utility::getAllPermission();
            $permissionsToExclude = ["create expenses", "edit expenses", "delete expenses"];
            $filteredPermissions = array_diff($allPermission, $permissionsToExclude);
            $valuesOffilteredPermissions = array_values($filteredPermissions);
            $jsonFormattedPermissions = json_encode($valuesOffilteredPermissions);

            if (ClientProject::where('client_id', '=', $client_id)->where('project_id', '=', $projectID)->count() == 0) {
                ClientProject::create(
                    [
                        'client_id' => $client_id,
                        'project_id' => $projectID,
                        'workspace_id' => $currentWorkspace->id,
                        // 'permission' => json_encode(Utility::getAllPermission()),
                        'permission' => $jsonFormattedPermissions,
                    ]
                );
---
select * from `users` where `id` = 7 limit 1
select * from `projects` where `projects`.`id` = '3' limit 1
select * from `clients` where `clients`.`id` = '3' limit 1
select count(*) as aggregate from `client_projects` where `client_id` = '3' and `project_id` = '3'
insert into `client_projects` (`client_id`, `project_id`, `workspace_id`, `permission`, `updated_at`, `created_at`) values ('3', '3', 4, '[\"create milestone\",\"edit milestone\",\"delete milestone\",\"show milestone\",\"create task\",\"edit task\",\"delete task\",\"show task\",\"move task\",\"show activity\",\"show uploading\",\"show timesheet\",\"show bug report\",\"create bug report\",\"edit bug report\",\"delete bug report\",\"move bug report\",\"show gantt\",\"show expenses\"]', '2025-03-12 19:02:07', '2025-03-12 19:02:07')

                $smtp_error = __('E-Mail has been not sent due to SMTP configuration');
            }

            ActivityLog::create(
                [
                    'user_id' => \Auth::user()->id,
                    'user_type' => get_class(\Auth::user()),
                    'project_id' => $project->id,
                    'log_type' => 'Share with Client',
                    'remark' => json_encode(['client_id' => $client->id]),
                ]
            );
---
insert into `activity_logs` (`user_id`, `user_type`, `project_id`, `log_type`, `remark`, `updated_at`, `created_at`) values (7, 'App\\Models\\User', 3, 'Share with Client', '{\"client_id\":3}', '2025-03-12 19:02:07', '2025-03-12 19:02:07')

    public function taskBoard($slug, $projectID)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        $objUser = Auth::user();
        if ($objUser->getGuard() == 'client') {
            $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
        } else {
            $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
        }
        if ($project) {

            $stages = $statusClass = [];

            $permissions = Auth::user()->getPermission($projectID);

            if ($project && (isset($permissions) && in_array('show task', $permissions)) || (isset($currentWorkspace) && $currentWorkspace->permission == 'Owner')) {
                $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();

                foreach ($stages as &$status) {
                    $statusClass[] = 'task-list-' . str_replace(' ', '_', $status->id);
                    $task = Task::where('project_id', '=', $projectID);

                    if ($currentWorkspace->permission != 'Owner' && $objUser->getGuard() != 'client') {
                        if (isset($objUser) && $objUser) {
                            $task->whereRaw("find_in_set('" . $objUser->id . "',assign_to)");
                        }
                    }
                    $task->orderBy('order');
                    $status['tasks'] = $task->where('status', '=', $status->id)->get();
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 2 and `projects`.`workspace` = 1 and `projects`.`id` = '1' limit 1
select * from `stages` where `workspace_id` = 1 order by `order` asc
select * from `tasks` where `project_id` = '1' and `status` = 1 order by `order` asc

    public function taskOrderUpdate(Request $request, $slug, $projectID)
    {

        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project_name = Project::where('id', $projectID)->first();

        $user1 = $currentWorkspace->id;

        if (isset($request->sort)) {
            foreach ($request->sort as $index => $taskID) {
                $task = Task::find($taskID);
                $task->order = $index;
                $task->save();
            }
        }

        if ($request->new_status != $request->old_status) {
            $new_status = Stage::find($request->new_status);
            $old_status = Stage::find($request->old_status);
            $user = Auth::user();
            $task = Task::find($request->id);
            $task->status = $request->new_status;
            $task->save();

            $name = $user->name;
            $id = $user->id;

            ActivityLog::create(
                [
                    'user_id' => $id,
                    'user_type' => get_class($user),
                    'project_id' => $projectID,
                    'log_type' => 'Move',
                    'remark' => json_encode(
                        [
                            'title' => $task->title,
                            'old_status' => $old_status->name,
                            'new_status' => $new_status->name,
                        ]
                    ),
                ]
            );
---
select * from `projects` where `id` = '1' limit 1
select * from `tasks` where `tasks`.`id` = '1' limit 1
select * from `stages` where `stages`.`id` = '3' limit 1
select * from `stages` where `stages`.`id` = '2' limit 1
insert into `activity_logs` (`user_id`, `user_type`, `project_id`, `log_type`, `remark`, `updated_at`, `created_at`) values (2, 'App\\Models\\User', '1', 'Move', '{\"title\":\"Test g\\u00f6rev\",\"old_status\":\"In Progress\",\"new_status\":\"Review\"}', '2024-11-03 23:08:43', '2024-11-03 23:08:43')

    public function taskDestroy($slug, $projectID, $taskID)
    {
        $objUser = Auth::user();
        $task = Task::where('id', $taskID)->delete();
---
delete from `tasks` where `id` = '2'

    public function allTasks($slug)
    {
        $userObj = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($userObj->getGuard() == 'client') {
            $projects = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $projects = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        }
        $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
        $users = User::select('users.*')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id')->where('user_workspaces.workspace_id', '=', $currentWorkspace->id)->get();
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 2 and `projects`.`workspace` = 1
select * from `stages` where `workspace_id` = 1 order by `order` asc
select `users`.* from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 1

    public function ajax_tasks($slug, Request $request)
    {
        $userObj = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($currentWorkspace->permission == 'Owner') {
            $tasks = Task::select(
                [
                    'tasks.*',
                    'stages.name as stage',
                    'stages.complete',
                ]
            )->join("user_projects", "tasks.project_id", "=", "user_projects.project_id")->join("projects", "projects.id", "=", "user_projects.project_id")->join("stages", "stages.id", "=", "tasks.status")->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id);
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 2 and `projects`.`workspace` = 1


            $tasks->whereBetween('tasks.due_date', [$startDate, $endDate]);
        }
        $tasks = $tasks->with('project')->get();
---
select * from `projects` where `projects`.`id` in (1)

    public function expenseReportEdit($workspaceSlug, $projectId, $expenseId)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($workspaceSlug);

        if ($objUser->getGuard() == 'client') {
            $project = Project::where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectId)->first();
            $expenseDetails = Expense::where('id', $expenseId)->first();
            $allTask = Task::where('project_id', $project->id)->get();
        } else {
            $project = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectId)->first();
            $expenseDetails = Expense::where('id', $expenseId)->first();
            $allTask = Task::where('project_id', $project->id)->get();
---
select `projects`.* from `projects` inner join `user_projects` on `user_projects`.`project_id` = `projects`.`id` where `user_projects`.`user_id` = 2 and `projects`.`workspace` = 1 and `projects`.`id` = '1' limit 1
select * from `expenses` where `id` = '1' limit 1
select * from `tasks` where `project_id` = 1