app/Http/Controllers/ProjectReportController.php

    public function index($slug)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($objUser && $currentWorkspace) {
            if ($objUser->getGuard() == 'client') {
                $projects = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
            } else {
                $projects = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
            }

            $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
            $users = User::select('users.*')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id')->where('user_workspaces.workspace_id', '=', $currentWorkspace->id)->get();
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 2 and `projects`.`workspace` = 1
select * from `stages` where `workspace_id` = 1 order by `order` asc
select `users`.* from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 1