app/Http/Controllers/UserController.php

select `users`.*, `user_workspaces`.`permission`, `user_workspaces`.`is_active` from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 1
select * from `users` where `type` != 'admin' and (`type` = 'user' and `plan` != 'NULL')
select * from `plans` where `plans`.`id` in (1, 2, 4)
---
    public function index($slug = null)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($currentWorkspace) {

            $users = User::select('users.*', 'user_workspaces.permission', 'user_workspaces.is_active')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id');
            $users->where('user_workspaces.workspace_id', '=', $currentWorkspace->id);
            $users = $users->get();
        } else {
            // $users = User::where('type', '!=', 'admin')->with('getPlan')->get();
            $users = User::where('type', '!=', 'admin')
                ->where([
                    ['type', '=', 'user'],
                    ['plan', '!=', 'NULL'],

                ])
                ->with('getPlan')
                ->get();

select * from `plans` where `is_plan_enable` = 1
select * from `users` where `users`.`id` = '7' limit 1
---
    public function changePlan($user_id)
    {
        $user = Auth::user();
        if ($user->type == 'admin') {
            $plans = Plan::where('is_plan_enable', 1)->get();
            $user = User::find($user_id);

select * from `users` where `users`.`id` = '2' limit 1
select * from `plans` where `plans`.`id` = '4' limit 1
insert into `orders` (`order_id`, `name`, `email`, `card_number`, `card_exp_month`, `card_exp_year`, `plan_name`, `plan_id`, `price`, `payment_frequency`, `price_currency`, `txn_id`, `payment_type`, `payment_status`, `receipt`, `user_id`, `updated_at`, `created_at`) values ('67D16C1338637092874608', null, null, null, null, null, 'Solopreneur & Freelancer Premium', 4, 8999, 'annual', 'USD', '', 'Süper Yönetici Tarafından Manuel Olarak Yükseltme', 'succeeded', null, 2, '2025-03-12 16:42:19', '2025-03-12 16:42:19')
---
    public function manuallyActivatePlan(Request $request, $user_id, $plan_id, $duration)
    {
        $user = User::find($user_id);
        $plan = Plan::find($plan_id);

        $assignPlan = $user->assignPlan($plan->id, $duration);

        if ($assignPlan['is_success'] == true && !empty($plan)) {
            $price = $plan->{$duration . '_price'};
            if (!empty($user->payment_subscription_id) && $user->payment_subscription_id != '') {
                try {
                    $user->cancel_subscription($user_id);
                } catch (\Exception $exception) {
                    \Log::debug($exception->getMessage());
                }
            }

            $orderID = strtoupper(str_replace('.', '', uniqid('', true)));
            Order::create(
                [
                    'order_id' => $orderID,
                    'name' => null,
                    'email' => null,
                    'card_number' => null,
                    'card_exp_month' => null,
                    'card_exp_year' => null,
                    'plan_name' => $plan->name,
                    'plan_id' => $plan->id,
                    'price' => $price,
                    'payment_frequency' => $duration,
                    'price_currency' => !empty(env('CURRENCY')) ? env('CURRENCY') : 'USD',
                    'txn_id' => '',
                    'payment_type' => __('Manually Upgrade By Super Admin'),
                    'payment_status' => 'succeeded',
                    'receipt' => null,
                    'user_id' => $user->id,
                ]
            );