app/Http/Controllers/WorkspaceController.php

select * from `taxes` where `workspace_id` = 4
select * from `stages` where `workspace_id` = 4 order by `order` asc
select * from `bug_stages` where `workspace_id` = 4 order by `order` asc
---
    public function settings($slug)
    {

        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($currentWorkspace && $currentWorkspace->created_by == $objUser->id) {

            $taxes = Tax::where('workspace_id', '=', $currentWorkspace->id)->get();
            $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();

select * from `email_templates`
---
            ];

            $payment_detail = Utility::getPaymentSetting($currentWorkspace->id);
            $EmailTemplates = EmailTemplate::all();