app/Models/Task.php

    public function users()
    {
        $users = User::whereIn('id', explode(',', $this->assign_to))->get();
---
select * from `users` where `id` in ('2')

    public function milestone()
    {
        return $this->milestone_id ? Milestone::find($this->milestone_id) : null;
---
select * from `milestones` where `milestones`.`id` = '1' limit 1

    public function sub_tasks()
    {
        return $this->hasMany('App\Models\SubTask', 'task_id', 'id')->orderBy('id', 'DESC');
---
select * from `sub_tasks` where `sub_tasks`.`task_id` = 1 and `sub_tasks`.`task_id` is not null order by `id` desc