app/Models/User.php

    public function countTask($workspace_id)
    {
        return Task::join('projects', 'tasks.project_id', '=', 'projects.id')->where('projects.workspace', '=', $workspace_id)->where('tasks.assign_to', '=', $this->id)->count();
---
select count(*) as aggregate from `tasks` inner join `projects` on `tasks`.`project_id` = `projects`.`id` where `projects`.`workspace` = 1 and `tasks`.`assign_to` = 2

    public function getPermission($project_id)
    {
        $data = UserProject::where('user_id', '=', $this->id)->where('project_id', '=', $project_id)->first();
---
select * from `user_projects` where `user_id` = 2 and `project_id` = '1' limit 1