app/Models/User.php

select count(*) as aggregate from `user_projects` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 2 and `projects`.`workspace` = 1
---
    public function countProject($workspace_id = '')
    {
        $count = UserProject::join('projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $this->id);
        if (!empty($workspace_id)) {
            $count->where('projects.workspace', '=', $workspace_id);
        }

        return $count->count();

select count(*) as aggregate from `workspaces` where `created_by` = 2
---
    public function countWorkspace()
    {
        return Workspace::where('created_by', '=', $this->id)->count();

select * from `user_workspaces` inner join `workspaces` on `workspaces`.`id` = `user_workspaces`.`workspace_id` inner join `users` on `users`.`id` = `workspaces`.`created_by` and `users`.`id` = 2 where `user_workspaces`.`permission` = 'Member'
---
    public function countUsers($workspace_id)
    {
        $count = UserWorkspace::join('workspaces', 'workspaces.id', '=', 'user_workspaces.workspace_id');
        if (!empty($workspace_id)) {
            $count->where('workspaces.id', '=', $workspace_id);
        } else {
            // $count->whereIn(
            //     'workspaces.id',
            //     function ($query) {
            //         $query->select('workspace_id')->from('user_workspaces')->where('permission', '=', 'Owner')->where('user_id', '=', $this->id);
            //     }
            // );
            $count = UserWorkspace::join('workspaces', 'workspaces.id', '=', 'user_workspaces.workspace_id')
                ->join('users', function ($join) {
                    $join->on('users.id', '=', 'workspaces.created_by')
                        ->where('users.id', '=', $this->id);
                })
                ->where('user_workspaces.permission', 'Member')
                ->get();

select count(*) as aggregate from `client_workspaces` inner join `workspaces` on `workspaces`.`id` = `client_workspaces`.`workspace_id` where `workspaces`.`id` in (select `workspace_id` from `user_workspaces` where `permission` = 'Owner' and `user_id` = 2)
---
    public function countClients($workspace_id)
    {
        $count = ClientWorkspace::join('workspaces', 'workspaces.id', '=', 'client_workspaces.workspace_id');
        if (!empty($workspace_id)) {
            $count->where('workspaces.id', '=', $workspace_id);
        } else {
            $count->whereIn(
                'workspaces.id',
                function ($query) {
                    $query->select('workspace_id')->from('user_workspaces')->where('permission', '=', 'Owner')->where('user_id', '=', $this->id);
                }
            );

select * from `plans` where `plans`.`id` = 4 limit 1
select * from `workspaces` where `created_by` = 2
select * from `user_workspaces` where `workspace_id` = 1
update `user_workspaces` set `is_active` = 0, `user_workspaces`.`updated_at` = '2025-03-12 16:42:19' where `id` = 2
update `user_projects` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` set `user_projects`.`is_active` = 1, `user_projects`.`updated_at` = '2025-03-12 16:42:19' where `projects`.`workspace` = 1 and `user_projects`.`user_id` = 2
select * from `client_workspaces` where `workspace_id` = 1
---
    public function assignPlan($planID, $frequency = '')
    {
        $plan = Plan::find($planID);
        if ($plan) {
            $workspaces = Workspace::where('created_by', '=', $this->id)->get();
            $workspacesCount = 0;
            foreach ($workspaces as $workspace) {
                $workspacesCount++;
                $workspace->is_active = $plan->max_workspaces == -1 ? 1 : (($workspacesCount <= $plan->max_workspaces) ? 1 : 0);
                $workspace->save();

                $projectCount = 0;
                foreach ($workspace->projects as $project) {
                    $projectCount++;
                    $project->is_active = $plan->max_projects == -1 || $projectCount <= $plan->max_projects ? 1 : 0;
                    $project->save();
                }

                $userWorkspaces = UserWorkspace::where('workspace_id', '=', $workspace->id)->get();
                $userWorkspacesCount = 0;
                foreach ($userWorkspaces as $userWorkspace) {
                    $userWorkspacesCount++;
                    $userWorkspace->is_active = $plan->max_users == -1 || $userWorkspacesCount <= $plan->max_users ? 1 : 0;
                    $userWorkspace->save();

                    UserProject::join('projects', 'projects.id', '=', 'user_projects.project_id')->where('projects.workspace', '=', $workspace->id)->where('user_projects.user_id', '=', $userWorkspace->user_id)->update(['user_projects.is_active' => $userWorkspace->is_active]);
                }

                $clientWorkspaces = ClientWorkspace::where('workspace_id', '=', $workspace->id)->get();

update `client_projects` inner join `projects` on `projects`.`id` = `client_projects`.`project_id` set `client_projects`.`is_active` = 1, `client_projects`.`updated_at` = '2025-03-12 16:42:19' where `projects`.`workspace` = 1 and `client_projects`.`client_id` = 1
---
                    $clientWorkspace->is_active = $plan->max_clients == -1 || $clientWorkspacesCount <= $plan->max_clients ? 1 : 0;
                    $clientWorkspace->save();

                    ClientProject::join('projects', 'projects.id', '=', 'client_projects.project_id')->where('projects.workspace', '=', $workspace->id)->where('client_projects.client_id', '=', $clientWorkspace->client_id)->update(['client_projects.is_active' => $clientWorkspace->is_active]);

update `users` set `plan` = 4, `plan_expire_date` = '2026-03-12', `users`.`updated_at` = '2025-03-12 16:42:19' where `id` = 2
---
            } else {
                $this->plan_expire_date = null;
            }
            $this->save();

select * from `bug_reports` where `bug_reports`.`id` in (1, 2)
select * from `projects` where `projects`.`id` in (1)
select * from `tasks` where `tasks`.`id` in (1, 2)
select * from `users` where `users`.`id` in (2)
---
    public function notifications($workspace_id)
    {
        return Notification::select('notifications.*')
            ->with(['user', 'project', 'task', 'bugReport'])
            ->leftJoin('projects', function ($join) {
                $join->on('notifications.related_id', '=', 'projects.id')
                    ->where('notifications.type', 'project_assign');
            })
            ->leftJoin('tasks', function ($join) {
                $join->on('notifications.related_id', '=', 'tasks.id')
                    ->where('notifications.type', 'task_assign');
            })
            ->leftJoin('bug_reports', function ($join) {
                $join->on('notifications.related_id', '=', 'bug_reports.id')
                    ->where('notifications.type', 'bug_assign');
            })
            ->where('user_id', $this->id)
            ->where('workspace_id', $workspace_id)
            ->where('is_read', 0)
            ->orderBy('notifications.id', 'desc')
            ->get();