app/Models/Utility.php

    public static function getWorkspaceBySlug($slug = null)
    {
        $objUser = Auth::user();

        if ($objUser && $objUser->currant_workspace) {
            if ($objUser->getGuard() == 'client') {
                $rs = Workspace::select(['workspaces.*'])->join('client_workspaces', 'workspaces.id', '=', 'client_workspaces.workspace_id')->where('workspaces.id', '=', $objUser->currant_workspace)->where('client_id', '=', $objUser->id)->first();
            } else {
                $rs = Workspace::select([
                    'workspaces.*',
                    'user_workspaces.permission',
                ])->join('user_workspaces', 'workspaces.id', '=', 'user_workspaces.workspace_id')->where('workspaces.id', '=', $objUser->currant_workspace)->where(
                        'user_id',
                        '=',
                        $objUser->id
                    )->first();
---
select `workspaces`.*, `user_workspaces`.`permission` from `workspaces` inner join `user_workspaces` on `workspaces`.`id` = `user_workspaces`.`workspace_id` where `workspaces`.`id` = 1 and `user_id` = 2 limit 1

    public static function fetchlanguages()
    {
        $settings = Utility::getAdminPaymentSetting();
        $disablelang = $settings['disable_lang'];

        // Use Eloquent to fetch all languages from the database, including English
        $languages = Languages::whereNotIn('lang_code', explode(',', $disablelang))
            ->orWhere('lang_code', 'en') // Include English
            ->pluck('lang_fullname', 'lang_code')
            ->all();
---
select `lang_fullname`, `lang_code` from `languages` where `lang_code` not in ('') or `lang_code` = 'en'

    public static function webhookSetting($module, $user_id = null)
    {
        if (\Auth::check()) {
            $webhook = Webhook::where('module', $module)->where('created_by', '=', Auth::user()->id)->first();
---
select * from `webhooks` where `module` = 'Task Stage Updated' and `created_by` = 2 limit 1

    public static function getlang_fullname($code)
    {
        $languages = Utility::langList();
        if (\Schema::hasTable('languages')) {
            $lang = Languages::where('lang_code', '=', $code)->first();
---
select * from `languages` where `lang_code` = 'tr' limit 1