app/Models/Utility.php

select `workspaces`.*, `user_workspaces`.`permission` from `workspaces` inner join `user_workspaces` on `workspaces`.`id` = `user_workspaces`.`workspace_id` where `workspaces`.`id` = 1 and `user_id` = 2 limit 1
---
    public static function getWorkspaceBySlug($slug = null)
    {
        $objUser = Auth::user();

        if ($objUser && $objUser->currant_workspace) {
            if ($objUser->getGuard() == 'client') {
                $rs = Workspace::select(['workspaces.*'])->join('client_workspaces', 'workspaces.id', '=', 'client_workspaces.workspace_id')->where('workspaces.id', '=', $objUser->currant_workspace)->where('client_id', '=', $objUser->id)->first();
            } else {
                $rs = Workspace::select([
                    'workspaces.*',
                    'user_workspaces.permission',
                ])->join('user_workspaces', 'workspaces.id', '=', 'user_workspaces.workspace_id')->where('workspaces.id', '=', $objUser->currant_workspace)->where(
                        'user_id',
                        '=',
                        $objUser->id
                    )->first();

select `lang_fullname`, `lang_code` from `languages` where `lang_code` not in ('') or `lang_code` = 'en'
---
    public static function fetchlanguages()
    {
        $settings = Utility::getAdminPaymentSetting();
        $disablelang = $settings['disable_lang'];

        // Use Eloquent to fetch all languages from the database, including English
        $languages = Languages::whereNotIn('lang_code', explode(',', $disablelang))
            ->orWhere('lang_code', 'en') // Include English
            ->pluck('lang_fullname', 'lang_code')
            ->all();

select count(*) as aggregate from `projects` where `workspace` = 4
---
    public static function userprojectcount(){

        $user=Auth::user();
        $currant_workspace = $user->currant_workspace;

   return  Project::where('workspace', '=', $currant_workspace)->count();

select count(*) as aggregate from `clients` where `currant_workspace` = 4
---
    public static function isClientRestrictedDemo(){

     if(Utility::isdemopackage()||Utility::isFinishPackageTime()){

          $user=Auth::user();
          $currant_workspace = $user->currant_workspace;

      $clientcount= Client::where('currant_workspace', '=', $currant_workspace)->count();

select * from `plans` where `plans`.`id` = 3 limit 1
---
public static function isdemopackage(){
     $user=Auth::user();


     $userPlanid = $user->plan;
$planname= Plan::find($userPlanid)->name;

select * from `workspaces` where `id` = 1 limit 1
---
    public static function send_telegram_msg($type, $obj, $user)
    {
        $user_lang = Workspace::where('id', $user)->first();

select * from `workspaces` where `id` = 1 limit 1
---
    public static function fetchgetcompanySettings($slug)
    {
        $data = Workspace::where('id', $slug)->first();

select * from `workspaces` where `id` = 1 limit 1
---
    public static function fetchgetcompanylogo($slug)
    {
        $data = Workspace::where('id', $slug)->first();

select * from `clients` where `clients`.`id` = 3 limit 1
select * from `email_templates` where `name` LIKE 'Project Assigned' limit 1
select * from `user_email_templates` where `template_id` = 3 and `user_id` = 7 limit 1
---
    public static function sendclientEmailTemplate($emailTemplate, $user_id, $obj)
    {
        $usr = Auth::user();

        if ($user_id != $usr->id) {
            $mailTo = Client::find($user_id)->email;

            if ($usr->type != 'admin') {
                // find template is exist or not in our record
                $template = EmailTemplate::where('name', 'LIKE', $emailTemplate)->first();

                if (isset($template) && !empty($template)) {
                    // check template is active or not by company
                    $is_active = UserEmailTemplate::where('template_id', '=', $template->id)->where('user_id', '=', $usr->id)->first();

select * from `workspaces` where `id` = 4 limit 1
select * from `email_template_langs` where `parent_id` = 3 and `lang` LIKE 'tr' limit 1
---
                        }

                        //  $settings = self::setMailConfig();
                        $user_lang = Workspace::where('id', $usr->currant_workspace)->first();
                        // get email content language base
                        $content = EmailTemplateLang::where('parent_id', '=', $template->id)->where('lang', 'LIKE', $user_lang->lang)->first();

select * from `languages` where `lang_code` = 'tr' limit 1
---
    public static function getlang_fullname($code)
    {
        $languages = Utility::langList();
        if (\Schema::hasTable('languages')) {
            $lang = Languages::where('lang_code', '=', $code)->first();