app/Models/Workspace.php

    public function owner($id)
    {
        $owner1 = UserWorkspace::where('workspace_id', $id)->where('permission', 'Owner')->first();
        $owner = User::find($owner1->user_id);
---
select * from `user_workspaces` where `workspace_id` = 1 and `permission` = 'Owner' limit 1
select * from `users` where `users`.`id` = 2 limit 1

    public function is_chagpt_enable()
    {
        $owner1 = UserWorkspace::where('workspace_id', $this->id)->where('permission', 'Owner')->first();
        $owner = User::find($owner1->user_id);
        $plan = Plan::find($owner->plan);
---
select * from `user_workspaces` where `workspace_id` = 4 and `permission` = 'Owner' limit 1
select * from `users` where `users`.`id` = 7 limit 1
select * from `plans` where `plans`.`id` = 2 limit 1